YCSB Outputs/Workload A/loada3
[WARN]  Running against a source checkout. In order to get our runtime dependencies we'll have to invoke Maven. Depending on the state of your system, this may take ~30-45 seconds
[DEBUG]  Running 'mvn -pl site.ycsb:mongodb-binding -am package -DskipTests dependency:build-classpath -DincludeScope=compile -Dmdep.outputFilterFile=true'
WARNING: An illegal reflective access operation has occurred
WARNING: Illegal reflective access by com.google.inject.internal.cglib.core.$ReflectUtils$1 (file:/usr/share/maven/lib/guice.jar) to method java.lang.ClassLoader.defineClass(java.lang.String,byte[],int,int,java.security.ProtectionDomain)
WARNING: Please consider reporting this to the maintainers of com.google.inject.internal.cglib.core.$ReflectUtils$1
WARNING: Use --illegal-access=warn to enable warnings of further illegal reflective access operations
WARNING: All illegal access operations will be denied in a future release
java -cp /home/swan/YCSB/mongodb/conf:/home/swan/YCSB/mongodb/target/mongodb-binding-0.18.0-SNAPSHOT.jar:/home/swan/.m2/repository/org/apache/htrace/htrace-core4/4.1.0-incubating/htrace-core4-4.1.0-incubating.jar:/home/swan/.m2/repository/org/xerial/snappy/snappy-java/1.1.7.1/snappy-java-1.1.7.1.jar:/home/swan/.m2/repository/org/hdrhistogram/HdrHistogram/2.1.4/HdrHistogram-2.1.4.jar:/home/swan/.m2/repository/org/mongodb/mongo-java-driver/3.11.0/mongo-java-driver-3.11.0.jar:/home/swan/.m2/repository/org/codehaus/jackson/jackson-mapper-asl/1.9.4/jackson-mapper-asl-1.9.4.jar:/home/swan/.m2/repository/org/codehaus/jackson/jackson-core-asl/1.9.4/jackson-core-asl-1.9.4.jar:/home/swan/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/home/swan/.m2/repository/com/allanbank/mongodb-async-driver/2.0.1/mongodb-async-driver-2.0.1.jar site.ycsb.Client -db site.ycsb.db.MongoDbClient -s -P workloads/workloada -t -p recordcount=300000 -threads 16 -p mongodb.url=mongodb://localhost:27017/yscb -p mongodb.auth=true -load
Command line: -db site.ycsb.db.MongoDbClient -s -P workloads/workloada -t -p recordcount=300000 -threads 16 -p mongodb.url=mongodb://localhost:27017/yscb -p mongodb.auth=true -load
YCSB Client 0.18.0-SNAPSHOT

Loading workload...
Starting test.
2020-04-24 06:06:25:840 0 sec: 0 operations; est completion in 0 second 
Apr 24, 2020 6:06:26 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster created with settings {hosts=[localhost:27017], mode=SINGLE, requiredClusterType=UNKNOWN, serverSelectionTimeout='30000 ms', maxWaitQueueSize=500}
mongo client connection created with mongodb://localhost:27017/yscb
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
Apr 24, 2020 6:06:26 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 6:06:26 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 6:06:26 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 6:06:26 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 6:06:26 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 6:06:26 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 6:06:26 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 6:06:26 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 6:06:26 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 6:06:26 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 6:06:26 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 6:06:26 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 6:06:26 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 6:06:26 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 6:06:26 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 6:06:26 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 6:06:26 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:1, serverValue:37}] to localhost:27017
Apr 24, 2020 6:06:26 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Monitor thread successfully connected to server with description ServerDescription{address=localhost:27017, type=STANDALONE, state=CONNECTED, ok=true, version=ServerVersion{versionList=[4, 2, 6]}, minWireVersion=0, maxWireVersion=8, maxDocumentSize=16777216, logicalSessionTimeoutMinutes=30, roundTripTimeNanos=6673718}
Apr 24, 2020 6:06:26 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:10, serverValue:39}] to localhost:27017
Apr 24, 2020 6:06:27 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:15, serverValue:48}] to localhost:27017
Apr 24, 2020 6:06:27 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:7, serverValue:49}] to localhost:27017
Apr 24, 2020 6:06:27 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:13, serverValue:43}] to localhost:27017
Apr 24, 2020 6:06:27 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:8, serverValue:40}] to localhost:27017
Apr 24, 2020 6:06:27 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:5, serverValue:50}] to localhost:27017
Apr 24, 2020 6:06:27 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:12, serverValue:42}] to localhost:27017
Apr 24, 2020 6:06:27 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:14, serverValue:46}] to localhost:27017
Apr 24, 2020 6:06:27 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:16, serverValue:47}] to localhost:27017
Apr 24, 2020 6:06:27 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:11, serverValue:44}] to localhost:27017
Apr 24, 2020 6:06:27 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:3, serverValue:51}] to localhost:27017
Apr 24, 2020 6:06:27 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:17, serverValue:53}] to localhost:27017
Apr 24, 2020 6:06:27 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:4, serverValue:52}] to localhost:27017
Apr 24, 2020 6:06:27 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:9, serverValue:41}] to localhost:27017
Apr 24, 2020 6:06:27 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:2, serverValue:38}] to localhost:27017
Apr 24, 2020 6:06:27 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:6, serverValue:45}] to localhost:27017
2020-04-24 06:06:35:765 10 sec: 99137 operations; 9913.7 current ops/sec; est completion in 21 seconds [INSERT: Count=99137, Max=358399, Min=141, Avg=1409.53, 90=2433, 99=7647, 99.9=24447, 99.99=356863] 
2020-04-24 06:06:45:765 20 sec: 243860 operations; 14472.3 current ops/sec; est completion in 5 second [INSERT: Count=144732, Max=186623, Min=134, Avg=1114.85, 90=1911, 99=7675, 99.9=30591, 99.99=148095] 
Apr 24, 2020 6:06:50 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:8, serverValue:40}] to localhost:27017 because the pool has been closed.
Apr 24, 2020 6:06:50 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:9, serverValue:41}] to localhost:27017 because the pool has been closed.
Apr 24, 2020 6:06:50 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:7, serverValue:49}] to localhost:27017 because the pool has been closed.
Apr 24, 2020 6:06:50 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:6, serverValue:45}] to localhost:27017 because the pool has been closed.
Apr 24, 2020 6:06:50 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:13, serverValue:43}] to localhost:27017 because the pool has been closed.
Apr 24, 2020 6:06:50 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:15, serverValue:48}] to localhost:27017 because the pool has been closed.
Apr 24, 2020 6:06:50 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:10, serverValue:39}] to localhost:27017 because the pool has been closed.
Apr 24, 2020 6:06:50 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:12, serverValue:42}] to localhost:27017 because the pool has been closed.
Apr 24, 2020 6:06:50 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:5, serverValue:50}] to localhost:27017 because the pool has been closed.
Apr 24, 2020 6:06:50 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:3, serverValue:51}] to localhost:27017 because the pool has been closed.
Apr 24, 2020 6:06:50 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:2, serverValue:38}] to localhost:27017 because the pool has been closed.
Apr 24, 2020 6:06:50 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:11, serverValue:44}] to localhost:27017 because the pool has been closed.
Apr 24, 2020 6:06:50 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:14, serverValue:46}] to localhost:27017 because the pool has been closed.
Apr 24, 2020 6:06:50 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:17, serverValue:53}] to localhost:27017 because the pool has been closed.
Apr 24, 2020 6:06:50 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:4, serverValue:52}] to localhost:27017 because the pool has been closed.
Apr 24, 2020 6:06:50 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:16, serverValue:47}] to localhost:27017 because the pool has been closed.
2020-04-24 06:06:50:152 24 sec: 300000 operations; 12793.98 current ops/sec; [CLEANUP: Count=16, Max=50143, Min=1, Avg=3134.81, 90=2, 99=50143, 99.9=50143, 99.99=50143] [INSERT: Count=56131, Max=558591, Min=121, Avg=1166.12, 90=1894, 99=8151, 99.9=25215, 99.99=535039] 
[OVERALL], RunTime(ms), 24389
[OVERALL], Throughput(ops/sec), 12300.627331993932
[TOTAL_GCS_G1_Young_Generation], Count, 141
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 252
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.0332526958874904
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 141
[TOTAL_GC_TIME], Time(ms), 252
[TOTAL_GC_TIME_%], Time(%), 1.0332526958874904
[CLEANUP], Operations, 16
[CLEANUP], AverageLatency(us), 3134.8125
[CLEANUP], MinLatency(us), 1
[CLEANUP], MaxLatency(us), 50143
[CLEANUP], 95thPercentileLatency(us), 9
[CLEANUP], 99thPercentileLatency(us), 50143
[INSERT], Operations, 300000
[INSERT], AverageLatency(us), 1221.8209
[INSERT], MinLatency(us), 121
[INSERT], MaxLatency(us), 558591
[INSERT], 95thPercentileLatency(us), 3037
[INSERT], 99thPercentileLatency(us), 7747
[INSERT], Return=OK, 300000